Ran Plan for project: `vpc` dir: `infra/vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
{ "Credentials": { "AccessKeyId": "ASIA4QV4I4IYKXHXRPHP", "SecretAccessKey": "dmwUlNCbEmx5jT1ffDM/zaZHaDa+Rzw/+1j5mZv4", "SessionToken": "IQoJb3JpZ2luX2VjEEsaCXVzLWVhc3QtMSJHMEUCID1E8iq25Cj/CylbCdvEAmzwxG2h7cA0mxNpWLcf4MfsAiEA8LNCokLWaj035a3biAENe1fuGkNTgYbDiPMdGiL6bD8qrQII4///////////ARAAGgw4NjA0NjIwNDc3OTIiDM7KPvPWuxmrTWwyxiqBAuh7AQwkm9Fk1ZkulHYU4QPnQ6jJp8RYxOiTu4uZg2KSpQ9BpTvogD67phdOteFAJZyAN4S8ucxUXMSo6B2i0T0iMW6QbxtMfjfYOqzUC1GwhxODWZZpkXdL6qFljH1DoQnylwgK9ivm8UW0sioO9AaLawc5XFmPdjyC93L60nMPwY838h+CZEx5E+JU5kCfTi5crpcGPfQKKNiFwJDQku80V0bmTKygrR5gefUq7ZA2uCio93H9Ad6zbtS7fAREq4wleL/yEkkvAaPRG1n2nDiQclUbAwlCecczZUcJbptVUUdaTmBvl0h4KE25W5cNtVc21+ZYdBGXBv96p5AHHbRfMNWU258GOp0B7onYkuFaBIoYI8MLdCVyhgUthsIGJ9RD3a6fyaAt/XWrbexALA6JnHqN3ktHrTJmDX7/JmoyT8uDkpXK5PpZzBUwk2+HxIABUijvG0YGjeSFRIj7Fq5BYAnkSOuFrpZ/ng6isvmbMsoruWhYzcJy1OpU2dPpA0L/d8vaMvCXg7DCMp8zo9oblIxK6/Tr3n6dzwqdUQ8An8Zqlq2Adg==", "Expiration": "2023-02-23T03:07:17+00:00" }, "AssumedRoleUser": { "AssumedRoleId": "AROA4QV4I4IYH3GQDUPIE:atlantis-deploy-session", "Arn": "arn:aws:sts::860462047792:assumed-role/robot_role/atlantis-deploy-session" } }

ACCOUNT_ID=860462047792

BUCKET=devops-workshop-tf

time=2023-02-23T02:07:17Z level=warning msg=Encryption is not enabled on the S3 remote state bucket devops-workshop-tf. Terraform state files may contain secrets, so we STRONGLY recommend enabling encryption!

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/kubernetes v2.17.0...
- Installed hashicorp/kubernetes v2.17.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.8.0...
- Installed hashicorp/helm v2.8.0 (signed by HashiCorp)
- Installing hashicorp/aws v4.54.0...
- Installed hashicorp/aws v4.54.0 (signed by HashiCorp)

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

time=2023-02-23T02:07:32Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/vpc/aws. Relative paths in downloaded Terraform code may not work.
time=2023-02-23T02:07:32Z level=warning msg=Encryption is not enabled on the S3 remote state bucket devops-workshop-tf. Terraform state files may contain secrets, so we STRONGLY recommend enabling encryption! prefix=[/home/ubuntu/.atlantis/repos/Pin-Cheng/terragrunt/1/default/infra/vpc] 

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/kubernetes from the dependency lock file
- Reusing previous version of hashicorp/helm from the dependency lock file
- Installing hashicorp/aws v4.54.0...
- Installed hashicorp/aws v4.54.0 (signed by HashiCorp)
- Installing hashicorp/kubernetes v2.17.0...
- Installed hashicorp/kubernetes v2.17.0 (signed by HashiCorp)
- Installing hashicorp/helm v2.8.0...
- Installed hashicorp/helm v2.8.0 (signed by HashiCorp)

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "atlantis"
          + "Name"        = "devops"
          + "Terraform"   = "true"
        }
      + tags_all = {
          + "Environment" = "atlantis"
          + "Name"        = "devops"
          + "Terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-private-us-east-1a"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-private-us-east-1a"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-private-us-east-1b"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-private-us-east-1b"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-private-us-east-1c"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-private-us-east-1c"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-public"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "atlantis"
          + "Name"        = "devops-public"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.106.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "atlantis"
          + "Name"                            = "devops-private-us-east-1a"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "kubernetes.io/cluster/devops"    = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "atlantis"
          + "Name"                            = "devops-private-us-east-1a"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "kubernetes.io/cluster/devops"    = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.106.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "atlantis"
          + "Name"                            = "devops-private-us-east-1b"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "kubernetes.io/cluster/devops"    = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "atlantis"
          + "Name"                            = "devops-private-us-east-1b"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "kubernetes.io/cluster/devops"    = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.106.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                     = "atlantis"
          + "Name"                            = "devops-private-us-east-1c"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "kubernetes.io/cluster/devops"    = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "atlantis"
          + "Name"                            = "devops-private-us-east-1c"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "kubernetes.io/cluster/devops"    = "owned"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.106.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                  = "atlantis"
          + "Name"                         = "devops-public-us-east-1a"
          + "Terraform"                    = "true"
          + "kubernetes.io/cluster/devops" = "owned"
          + "kubernetes.io/role/elb"       = "1"
        }
      + tags_all                                       = {
          + "Environment"                  = "atlantis"
          + "Name"                         = "devops-public-us-east-1a"
          + "Terraform"                    = "true"
          + "kubernetes.io/cluster/devops" = "owned"
          + "kubernetes.io/role/elb"       = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.106.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                  = "atlantis"
          + "Name"                         = "devops-public-us-east-1b"
          + "Terraform"                    = "true"
          + "kubernetes.io/cluster/devops" = "owned"
          + "kubernetes.io/role/elb"       = "1"
        }
      + tags_all                                       = {
          + "Environment"                  = "atlantis"
          + "Name"                         = "devops-public-us-east-1b"
          + "Terraform"                    = "true"
          + "kubernetes.io/cluster/devops" = "owned"
          + "kubernetes.io/role/elb"       = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.106.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment"                  = "atlantis"
          + "Name"                         = "devops-public-us-east-1c"
          + "Terraform"                    = "true"
          + "kubernetes.io/cluster/devops" = "owned"
          + "kubernetes.io/role/elb"       = "1"
        }
      + tags_all                                       = {
          + "Environment"                  = "atlantis"
          + "Name"                         = "devops-public-us-east-1c"
          + "Terraform"                    = "true"
          + "kubernetes.io/cluster/devops" = "owned"
          + "kubernetes.io/role/elb"       = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.106.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = false
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "atlantis"
          + "Name"        = "devops"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "atlantis"
          + "Name"        = "devops"
          + "Terraform"   = "true"
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + azs                                         = [
      + "us-east-1a",
      + "us-east-1b",
      + "us-east-1c",
    ]
  + cgw_arns                                    = []
  + cgw_ids                                     = []
  + database_nat_gateway_route_ids              = []
  + database_route_table_association_ids        = []
  + database_route_table_ids                    = (known after apply)
  + database_subnet_arns                        = []
  + database_subnets                            = []
  + database_subnets_cidr_blocks                = []
  + database_subnets_ipv6_cidr_blocks           = []
  + default_network_acl_id                      = (known after apply)
  + default_route_table_id                      = (known after apply)
  + default_security_group_id                   = (known after apply)
  + elasticache_route_table_association_ids     = []
  + elasticache_route_table_ids                 = (known after apply)
  + elasticache_subnet_arns                     = []
  + elasticache_subnets                         = []
  + elasticache_subnets_cidr_blocks             = []
  + elasticache_subnets_ipv6_cidr_blocks        = []
  + igw_arn                                     = (known after apply)
  + igw_id                                      = (known after apply)
  + intra_route_table_association_ids           = []
  + intra_route_table_ids                       = []
  + intra_subnet_arns                           = []
  + intra_subnets                               = []
  + intra_subnets_cidr_blocks                   = []
  + intra_subnets_ipv6_cidr_blocks              = []
  + name                                        = "devops"
  + nat_ids                                     = []
  + nat_public_ips                              = []
  + natgw_ids                                   = []
  + outpost_subnet_arns                         = []
  + outpost_subnets                             = []
  + outpost_subnets_cidr_blocks                 = []
  + outpost_subnets_ipv6_cidr_blocks            = []
  + private_ipv6_egress_route_ids               = []
  + private_nat_gateway_route_ids               = []
  + private_route_table_association_ids         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_route_table_ids                     = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnet_arns                         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets                             = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + private_subnets_cidr_blocks                 = [
      + "10.106.1.0/24",
      + "10.106.2.0/24",
      + "10.106.3.0/24",
    ]
  + private_subnets_ipv6_cidr_blocks            = []
  + public_internet_gateway_route_id            = (known after apply)
  + public_route_table_association_ids          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_route_table_ids                      = [
      + (known after apply),
    ]
  + public_subnet_arns                          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets                              = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets_cidr_blocks                  = [
      + "10.106.101.0/24",
      + "10.106.102.0/24",
      + "10.106.103.0/24",
    ]
  + public_subnets_ipv6_cidr_blocks             = []
  + redshift_public_route_table_association_ids = []
  + redshift_route_table_association_ids        = []
  + redshift_route_table_ids                    = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + redshift_subnet_arns                        = []
  + redshift_subnets                            = []
  + redshift_subnets_cidr_blocks                = []
  + redshift_subnets_ipv6_cidr_blocks           = []
  + this_customer_gateway                       = {}
  + vpc_arn                                     = (known after apply)
  + vpc_cidr_block                              = "10.106.0.0/16"
  + vpc_enable_dns_hostnames                    = false
  + vpc_enable_dns_support                      = true
  + vpc_flow_log_destination_type               = "cloud-watch-logs"
  + vpc_id                                      = (known after apply)
  + vpc_instance_tenancy                        = "default"
  + vpc_ipv6_association_id                     = (known after apply)
  + vpc_ipv6_cidr_block                         = (known after apply)
  + vpc_main_route_table_id                     = (known after apply)
  + vpc_owner_id                                = (known after apply)
  + vpc_secondary_cidr_blocks                   = []

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/ubuntu/.atlantis/repos/Pin-Cheng/terragrunt/1/default/infra/vpc/vpc-default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/ubuntu/.atlantis/repos/Pin-Cheng/terragrunt/1/default/infra/vpc/vpc-default.tfplan"

time=2023-02-23T02:07:54Z level=warning msg=No double-slash (//) found in source URL /terraform-aws-modules/vpc/aws. Relative paths in downloaded Terraform code may not work.

All revocation operations queued successfully!
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](https://c47c-3-220-169-150.ngrok.io/lock?id=Pin-Cheng%252Fterragrunt%252Finfra%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vpc`
</details>
Plan: 19 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`